Version2/TestTool/TestTool.Setup/Requests/RecordingControl/SetRecordingJobMode/SetRecordingJobMode (General).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trc:SetRecordingJobMode>
      <trc:JobToken>tokenRecordingJob1</trc:JobToken>
      <trc:Mode>Active</trc:Mode>
    </trc:SetRecordingJobMode>
  </soap:Body>
</soap:Envelope>